erickfunier/STM32_Display_TFT/Projeto TFT_2/Src/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  /* USER CODE BEGIN 2 */
  begin(0x1289);
//  HAL_ADC_Start_DMA(&hadc1,(uint32_t*)ADC_BUF,2);
//  HAL_ADC_Start_IT(&hadc1);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
	  //fillScreen(GREEN);
	   testDrawScreen();
	   //readTouch();

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13|GPIO_PIN_14, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3 
                          |GPIO_PIN_4, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10|GPIO_PIN_11|GPIO_PIN_4|GPIO_PIN_5 
                          |GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9, GPIO_PIN_RESET);

  /*Configure GPIO pins : PC13 PC14 */
  GPIO_InitStruct.Pin = GPIO_PIN_13|GPIO_PIN_14;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : PA0 PA3 PA4 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_3|GPIO_PIN_4;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : PA1 PA2 */
  GPIO_InitStruct.Pin = GPIO_PIN_1|GPIO_PIN_2;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : PB10 PB11 PB5 PB6 */
  GPIO_InitStruct.Pin = GPIO_PIN_10|GPIO_PIN_11|GPIO_PIN_5|GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : PB4 PB7 PB8 PB9 */
  GPIO_InitStruct.Pin = GPIO_PIN_4|GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void begin(uint16_t ID) {
	wr_output();
	rs_output();
    reset();
    _lcd_xor = 0;
	_lcd_capable = 0 | XSA_XEA_16BIT | REV_SCREEN;
	// came from MikroElektronika library http://www.hmsprojects.com/tft_lcd.html
	static const uint16_t SSD1289_regValues[] = {
		0x0000, 0x0001,	//Oscilador do Display. Se 0x0001 (Oscilador ligado), se 0x0000 (Oscilador desligado) (page 27)
		0x0003, 0xA8A4, //Power Control (1) LCD - 0xA8A4 = 1010 1000 1010 0100 (page 34)
		0x000C, 0x0000, //Power Control (2) LCD - 0x0000 (page 38)
		0x000D, 0x080C, //Power Control (3) LCD - 0x000C = 0000 0000 0000 1100 (page 39)    // was 0x800C or 0x080C
		0x000E, 0x2B00, //Power Control (4) LCD - 0x2B00 = 0010 1011 0000 0000 (page 39)
		0x001E, 0x00B7, //Power Control (5) LCD - 0x00B7 = 0000 0000 1011 0111 (page 46)
		0x0001, 0x2B3F, //Driver Output Control - 0x2B3F = 0010 1011 0011 1111 (page 27)  // was 0x2B3F,
		0x0002, 0x0400, //LCD-Driving-Waveform Control - 0x0400 = 0000 0100 0000 0000 (page 31)    // was 0x0600 or 0x0400
		0x0010, 0x0000, //Sleep Mode - 0x0000. Se 0x0000 não entra em Sleep, se 0x0001 entra em modo sleep (page 40)
		0x0011, 0x6070, //Entry Mode - 0x6070 = 0110 0000 0111 0000 (page 40)   // was 0x6070
		0x0005, 0x0000, //Compare Register Red and Green (page 36)
		0x0006, 0x0000, //Compare Register Blue (page 36)
		0x0016, 0xEF1C, //Horizontal Porch 0xEF1C = 1110 1111 0001 1100 (page 44)
		0x0017, 0x0003, //Vertical Porch 0x0003 = 0000 0000 0000 0011 (page 45)
		0x0007, 0x0233, //Display Control 0x0233 = 0000 0010 0011 0011 (page 36) Tela estranha
		0x000B, 0x0000, //Frame Cycle Control (page 36)
		0x000F, 0x0000, //Gate Scan Position (page 40)
		0x0041, 0x0000, //Vertical Scroll Control (page 49)
		0x0042, 0x0000, //Vertical Scroll Control (page 49)
		0x0048, 0x0000, //First Screen Driving Position (page 49)
		0x0049, 0x013F, //First Screen Driving Position (page 49)
		0x004A, 0x0000, //Second Screen Driving Position (page 50)
		0x004B, 0x0000, //Second Screen Driving Position (page 50)
		0x0044, 0xEF95, //Horizontal RAM address position (page 49)
		0x0045, 0x0000, //Vertical RAM address position (page 49)
		0x0046, 0x013F, //Vertical RAM address position (page 49)
		0x0030, 0x0707, //Gamma Control (page 48)
		0x0031, 0x0204, //Gamma Control (page 48)
		0x0032, 0x0204, //Gamma Control (page 48)
		0x0033, 0x0502, //Gamma Control (page 48)
		0x0034, 0x0507, //Gamma Control (page 48)
		0x0035, 0x0204, //Gamma Control (page 48)
		0x0036, 0x0204, //Gamma Control (page 48)
		0x0037, 0x0502, //Gamma Control (page 48)
		0x003A, 0x0302, //Gamma Control (page 48)
		0x003B, 0x0302, //Gamma Control (page 48)
		0x0023, 0x0000, //RAM Write data mask (page 46)
		0x0024, 0x0000, //RAM Write data mask (page 46)
		0x0025, 0x8000, //Frame Frequency Control (page 47)
		0x004f, 0x0000, //RAM address set (page 50)
		0x004e, 0x0000, //RAM address set (page 50)
	};
	init_table16(SSD1289_regValues, sizeof(SSD1289_regValues));
	_lcd_rev = ((_lcd_capable & REV_SCREEN) != 0);
    //setRotation(0);             //PORTRAIT
    invertDisplay(false);
    setRotation(3);
    fillScreen(GREEN);
}

//void readTouch(){
//	char resultx[50];
//	char resulty[50];
//	int samples = 20;
//	int temp = 0;
//
//	for (int i = 0; i < 20; i++) {
//		readTouchX();
//		if (flag_adc == 0) {
//			temp += val_adc1;
//		}
//	}
//	touchx_atual = temp/samples;
//
//	sprintf(resultx, "%i", touchx_atual);
//
//	fillRect(40, 148, 80, 18, GREEN);
//
//	setCursor(40, 148);
//	setTextSize(2);
//	print(resultx);
//
//	temp = 0;
//	for (int i = 0; i < samples; i++) {
//		readTouchY();
//		if (flag_adc == 0) {
//			temp += val_adc2;
//		}
//	}
//	touchy_atual = temp/samples;
//
//	sprintf(resulty, "%i", touchy_atual);
//
//	fillRect(154, 148, 80, 18, GREEN);
//
//	setCursor(154, 148);
//	setTextSize(2);
//	print(resulty);
//}

//void readTouchX() {
//	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6, GPIO_PIN_RESET);
//	rs_cmd();
//	rs_analog_input(); //_yp
//
//	wr_idle(); //_yp HIGH
//	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_RESET);
//
//	flag_adc = 1;
////	HAL_ADC_Start_IT(&hadc1);
//	rs_output();
//}

//void readTouchY() {
//	wr_analog_input(); //_yp
//	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6, GPIO_PIN_SET);
//	rs_cmd(); //_ym LOW
//
//	flag_adc = 1;
////	HAL_ADC_Start_IT(&hadc1);
//	wr_output();
//}

void invertDisplay(bool i) {
    _lcd_rev = ((_lcd_capable & REV_SCREEN) != 0) ^ i;
    _lcd_drivOut &= ~(1 << 13);
	if (_lcd_rev)
		_lcd_drivOut |= (1 << 13);
	writeCmdData(0x01, _lcd_drivOut);
}

void init_table16(const uint16_t table[], int16_t size) {
	int16_t i = 0;
	while (size > 0) {
		int16_t cmd = table[i];
		int16_t d = table[i+1];
		writeCmdData(cmd, d);                      //static function
		size -= 2 * sizeof(int16_t);
		i += 2;
	}
}

void fillScreen(uint16_t color) {
	fillRect(0, 0, WIDTH, HEIGHT, color);
}

void fillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
	int16_t end;
	if (w < 0) {
		w = -w;
		x -= w;
	}                           //+ve w
	end = x + w;
	if (x < 0)
		x = 0;
	if (end > WIDTH)
		end = WIDTH;
	w = end - x;
	if (h < 0) {
		h = -h;
		y -= h;
	}                           //+ve h
	end = y + h;
	if (y < 0)
		y = 0;
	if (end > HEIGHT)
		end = HEIGHT;
	h = end - y;
	setAddrWindow(x, y, x + w - 1, y + h - 1);
	cs_active();
	writeCmd(_MW);
	if (h > w) {
		end = h;
		h = w;
		w = end;
	}
	uint8_t hi = color >> 8, lo = color & 0xFF;
	while (h-- > 0) {
		end = w;
		do {
			write8(hi);
			write8(lo);
		} while (--end != 0);
    }
    cs_idle();
    if (!(_lcd_capable & MIPI_DCS_REV1) || ((_lcd_ID == 0x1526) && (rotation & 1)))
        setAddrWindow(0, 0, WIDTH - 1, HEIGHT - 1);
}

