erickfunier/STM32_Display_TFT/Projeto TFT_2/Src/main.c
void drawPixel(int16_t x, int16_t y, uint16_t color)
{
    // MCUFRIEND just plots at edge if you try to write outside of the box:
    if (x < 0 || y < 0 || x >= WIDTH || y >= HEIGHT)
        return;
    setAddrWindow(x, y, x, y);
    writeCmdData(_MW, color);
}

void testDrawScreen() {
	// Titulo
	setCursor(16, 16);
	setTextColor(BLUE, GREEN);
	setTextSize(4);
	print("UfAbC TeStE!!");

	// Botao 1
	setCursor(16, 70);
	setTextColor(BLUE, GREEN);
	setTextSize(4);
	print("BoTaO 1");
	drawRect(10, 62, 185, 45, BLUE);
	drawRect(11, 63, 183, 43, BLUE);

	setCursor(16, 148);
	setTextColor(BLUE, GREEN);
	setTextSize(2);
	print("X:");

	setCursor(130, 148);
	setTextColor(BLUE, GREEN);
	setTextSize(2);
	print("Y:");

	//vertScroll(0, 320, teste);

	if (teste >= 320) {
		teste = 0;
	} else {
		teste += 1;
	}

	if (touchx_atual > 150 && touchx_atual < 500 && touchy_atual > 780 && touchy_atual < 1450) {
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
	} else {
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
	}


	fillRect(320-teste, 100, 4, 30, RED);
	fillRect(320-teste+4, 100, 4, 30, GREEN);

	/*if (eixo_y_plus < 20) {
		fillRect(100+teste-2, 100+eixo_y_plus, 2, 2, RED);
		fillRect(100+teste-6, 100+eixo_y_plus-1, 2, 2, GREEN);
		eixo_y_plus++;

	} else {
		fillRect(100+teste-2, 100+eixo_y_minus, 2, 2, RED);
		fillRect(100+teste-6, 100+eixo_y_minus+1, 2, 2, GREEN);
		eixo_y_minus--;

		if (eixo_y_minus == 0) {
			eixo_y_plus = 0;
			eixo_y_minus = 20;
		}
	}*/
}

void setRotation(uint8_t r) {
	uint16_t GS, SS_v, ORG, REV = _lcd_rev;
	uint8_t val;
    rotation = r & 3;           // just perform the operation ourselves on the protected variables
    if (rotation & 1) {
    	HEIGHT = _WIDTH;
    	WIDTH = _HEIGHT;
    }
    switch (rotation) {
    case 0:                    //PORTRAIT:
        val = 0x48;             //MY=0, MX=1, MV=0, ML=0, BGR=1
        break;
    case 1:                    //LANDSCAPE: 90 degrees
        val = 0x28;             //MY=0, MX=0, MV=1, ML=0, BGR=1
        break;
    case 2:                    //PORTRAIT_REV: 180 degrees
        val = 0x98;             //MY=1, MX=0, MV=0, ML=1, BGR=1
        break;
    case 3:                    //LANDSCAPE_REV: 270 degrees
        val = 0xF8;             //MY=1, MX=1, MV=1, ML=1, BGR=1
        break;
    }
	_MC = 0x4E, _MP = 0x4F, _MW = 0x22, _SC = 0x44, _EC = 0x44, _SP = 0x45, _EP = 0x46;
    if (rotation & 1)
    	val ^= 0xD0;    // exchange Landscape modes
	GS = (val & 0x80) ? (1 << 14) | (1 << 12) : 0;      //called TB (top-bottom)
	SS_v = (val & 0x40) ? (1 << 9) : 0;   //called RL (right-left)
	ORG = (val & 0x20) ? (1 << 3) : 0;  //called AM
	_lcd_drivOut = GS | SS_v | (REV << 13) | 0x013F;      //REV=0, BGR=0, MUX=319
	if (val & 0x08)
		_lcd_drivOut |= 0x0800; //BGR
	writeCmdData(0x01, _lcd_drivOut);   // set Driver Output Control
	writeCmdData(0x11, ORG | 0x6070);   // set GRAM write direction.

    if ((rotation & 1) && ((_lcd_capable & MV_AXIS) == 0)) {
        uint16_t x;
        x = _MC, _MC = _MP, _MP = x;
        x = _SC, _SC = _SP, _SP = x;    //.kbv check 0139
        x = _EC, _EC = _EP, _EP = x;    //.kbv check 0139
    }
    setAddrWindow(0, 0, WIDTH - 1, HEIGHT - 1);
    vertScroll(0, HEIGHT, 0);   //reset scrolling after a rotation
}

void setCursor(int16_t x, int16_t y) {
	cursor_x = x;
	cursor_y = y;
}

void setTextColor(uint16_t color, uint16_t txtbgcolor) {
	textcolor = color;
	textbgcolor = txtbgcolor;
}

void setTextSize(uint8_t size) {
	textsize = (size > 0) ? size : 1;
}

void print(char c[]) {
	size_t n = strlen(c);
	for (size_t i = 0; i < n; i++) {
		write(c[i]);
	}
}

void write(uint8_t c) {
    if(c == '\n') {                        // Newline?
        cursor_x  = 0;                     // Reset x to zero,
        cursor_y += textsize * 8;          // advance y one line
    } else if(c != '\r') {                 // Ignore carriage returns
        if(wrap && ((cursor_x + textsize * 6) > _width)) { // Off right?
            cursor_x  = 0;                 // Reset x to zero,
            cursor_y += textsize * 8;      // advance y one line
        }
        drawChar(WIDTH, HEIGHT, cursor_x, cursor_y, c, textcolor, textbgcolor, textsize);
        cursor_x += textsize * 6;          // Advance x one char
    }
}

void drawRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
	drawHLine(x, y, w, color);
	drawHLine(x, y+h-1, w, color);
	drawVLine(x, y, h, color);
	drawVLine(x+w-1, y, h, color);
}

void drawHLine(int16_t x, int16_t y, int16_t w, uint16_t color) {
	for(int i = 0; i < w; i++) {
		drawPixel(x+i, y, color);
	}
}

void drawVLine(int16_t x, int16_t y, int16_t h, uint16_t color) {
	for(int i = 0; i < h; i++) {
		drawPixel(x, y+i, color);
	}
}

void vertScroll (int16_t top, int16_t scrollines, int16_t offset) {
    int16_t vsp;
    if (offset <= -scrollines || offset >= scrollines) offset = 0; //valid scroll
    vsp = top + offset; // vertical start position
	if (offset < 0)
		vsp += scrollines;          //keep in unsigned range
	writeCmdData(0x41, vsp);        //VL#
}

void writeCmdData(uint16_t cmd, uint16_t dat)
{
    cs_active();
    writeCmd(cmd);
    writeData(dat);
    cs_idle();
}

void setAddrWindow(int16_t x, int16_t y, int16_t x1, int16_t y1) {
    writeCmdData(_MC, x);
    writeCmdData(_MP, y);
    if (!(x == x1 && y == y1)) {  //only need MC,MP for drawPixel
        if (_lcd_capable & XSA_XEA_16BIT) {
            if (rotation & 1)
                y1 = y = (y1 << 8) | y;
            else
                x1 = x = (x1 << 8) | x;
        }
        writeCmdData(_SC, x);
        writeCmdData(_SP, y);
        writeCmdData(_EC, x1);
        writeCmdData(_EP, y1);
    }
}

void rd_active() {
	HAL_GPIO_WritePin(RD_PORT, RD_PIN, GPIO_PIN_RESET);
}

void rd_idle() {
	HAL_GPIO_WritePin(RD_PORT, RD_PIN, GPIO_PIN_SET);
}

void wr_active() {
	HAL_GPIO_WritePin(WR_PORT, WR_PIN, GPIO_PIN_RESET);
}

void wr_idle() {
	HAL_GPIO_WritePin(WR_PORT, WR_PIN, GPIO_PIN_SET);
}

void rs_cmd() {
	HAL_GPIO_WritePin(RS_PORT, RS_PIN, GPIO_PIN_RESET);
}

void rs_data() {
	HAL_GPIO_WritePin(RS_PORT, RS_PIN, GPIO_PIN_SET);
}

void cs_active() {
	HAL_GPIO_WritePin(CS_PORT, CS_PIN, GPIO_PIN_RESET);
}

